## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_resource_group.rg-1 will be destroyed
  # (because azurerm_resource_group.rg-1 is not in configuration)
  - resource "azurerm_resource_group" "rg-1" {
      - id         = "/subscriptions/a2b47c47-f61e-492e-9529-9ff0c74be671/resourceGroups/rg-terraform-github-actions" -> null
      - location   = "eastus2" -> null
      - name       = "rg-terraform-github-actions" -> null
        # (1 unchanged attribute hidden)
    }

  # module.acr.azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "eastus2"
      + login_server                  = (known after apply)
      + name                          = "gmezanregistry001"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-terraform-github-actions"
      + sku                           = "Basic"
      + trust_policy_enabled          = false
      + zone_redundancy_enabled       = false
    }

  # module.rg1.azurerm_resource_group.resource_group will be created
  + resource "azurerm_resource_group" "resource_group" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "rg-terraform-github-actions"
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```
</details>